In [1]:
import json
import pandas as pd

In [5]:
json_file = "states_data.json"
with open(json_file) as train_file:
    dict_train = json.load(train_file)

train = pd.DataFrame.from_dict(dict_train, orient='index')
train.reset_index(level=0, inplace=True)
train

      index                                                  0
0      type                                  FeatureCollection
1  features  [{'type': 'Feature', 'id': '01', 'properties':...

In [4]:
pop_file = "pop-by-zip-code.csv"
inc_file = "Median_income.csv"
temp_file = "state-weather-data.csv"

pop_data = pd.read_csv(pop_file)
inc_data = pd.read_csv(inc_file)
temp_data = pd.read_csv(temp_file)

In [5]:
pop_data.head()

   zip_code  y-2016  y-2015  y-2014  y-2013  y-2012  y-2011  y-2010  aggregate
0       601   17800   17982   18088   18450   18544   18533   18570     127967
1       602   39716   40260   40859   41302   41640   41930   41520     287227
2       603   51565   52408   53162   53683   54540   54475   54689     374522
3       606    6320    6331    6415    6591    6593    6386    6615      45251
4       610   27976   28328   28805   28963   29141   29111   29016     201340

In [6]:
inc_data.head()

,"Table with row headers in column A and column headers in rows 5 and 6, and 60 and 61",Unnamed: 1,Unnamed: 2
0,State,2015,NaN
1,NaN,Median\nincome,Standard\nerror
2,United States,"56,516",321
3,Alabama,"44,509","3,419"
4,Alaska,"75,112","3,485"

In [7]:
temp_data.head()

    statename  latitude  longitude        min        max        avg
0     Alabama   32.9572   -87.1706  55.066541  75.862199  64.671307
1      Alaska   60.0433  -151.6655  25.085441  41.064363  33.105335
2     Arizona   35.0336  -113.8925  43.685663  67.698049  55.058667
3    Arkansas   34.6242   -93.8061  50.038002  70.851611  59.955121
4  California   41.7417  -121.5383  46.473216  69.615316  57.093592

In [9]:
len(pop_data["zip_code"])

33120